<template>
  <v-container class="my-16" :style="{
      'max-width': display.xl.value && '1320px'
    }"
  >
    <Title class="courses-title pb-4">
      Все курсы
    </Title>

    <v-row justify="center" class="course-card-container">
      <CourseCard
        v-for="(course, index) in courses"
        :key="index"
        :course="course"
        :index="index"
        class="card"
      />
    </v-row>
  </v-container>  
</template>

<script setup>
import CourseCard from '@/components/CourseCard.vue'
import { slideLeft } from '@/composables/useAnimations'
import { useDisplay } from 'vuetify/lib/framework.mjs'
import { gsap } from 'gsap/all'
import { onMounted } from 'vue'

slideLeft('.courses-title')

const display = useDisplay()
const courses = [
  {
    title: "Вёрстка сайтов (HTML и CSS)",
    price: 450,
    type: "Очное обучение",
    description: "450р - 1 занятие (Разовое посещение занятия)<br>1500р - 4 занятия(абонемент на месяц)<br>Курс 'Верстка сайта (HTML и CSS) для детей' предназначен для детей, возрастом от 10 до 16 лет, которые интересуются созданием собственных веб-сайтов. Этот курс нацелен на то, чтобы дети могли освоить основы веб-разработки, используя HTML и CSS - два фундаментальных языка для создания веб-страниц.<br>Цели и задачи курса:<br>Основы HTML: Дети изучат структуру HTML-документа, узнают о тегах, элементах, заголовках, параграфах, списках и ссылках.<br>Оформление с помощью CSS: Учащиеся научатся создавать стили для своих веб-страниц с помощью CSS, включая цвета, шрифты, размеры и фоновые изображения.<br>Макет и расположение элементов: Дети изучат основы макета веб-страницы, включая блочную модель, позиционирование элементов и создание простых макетов.<br>Работа с мультимедиа: Ученики научатся вставлять изображения и видео на свои страницы и настраивать их отображение.<br>Работа с формами: Дети узнают, как создавать формы для сбора информации от посетителей сайта, такие как контактные данные или отзывы.<br>Основы адаптивного дизайна: Курс может также включать в себя введение в адаптивный дизайн, чтобы дети могли делать свои сайты удобными для просмотра на разных устройствах.<br>Проектная работа: Курс может завершаться проектной работой, где ученики будут создавать свой собственный небольшой веб-сайт, применяя знания, полученные на занятиях.<br>Сотрудничество и коммуникация: Поддержка коммуникации и сотрудничества между учениками может стимулировать обмен знаний и идей.<br>Методы обучения:<br>Практические упражнения: Ученики будут активно создавать веб-страницы на практике, что поможет им лучше усвоить материал.<br>Интерактивные задания: Задания, требующие решения различных задач, помогут развивать аналитические навыки.<br>Проектная работа: Создание собственного сайта будет стимулировать творческое мышление и самостоятельность.<br>Обратная связь: Регулярная обратная связь и обсуждение результатов помогут ученикам развивать навыки и исправлять ошибки.<br>Преимущества курса:<br>Практическая польза: Ученики смогут создавать свои собственные веб-сайты, что может быть полезно для их будущей карьеры в IT или даже для создания личных проектов.<br>Развитие навыков: Курс способствует развитию логического мышления, креативности и коммуникационных навыков.<br>Доступность: HTML и CSS - это открытые и бесплатные технологии, и дети могут использовать их на любом компьютере с доступом в Интернет.<br>Поддержка учителя: Наличие опытного преподавателя, специализирующегося на обучении детей, поможет обеспечить эффективное обучение",
    img: (await import("@/assets/images/verstka.jpg")).default,
  },
  {
    title: "Основы видеомонтажа",
    price: 500,
    type: "Онлайн-курс",
    description: "Занятия проводятся для детей от 8 до 15 лет <br>500р - 1 занятие (Разовое посещение занятия) <br>1600р - 4 занятия(абонемент на месяц) <br>Курс 'Основы видеомонтажа для детей от 8 лет' представляет собой захватывающее путешествие в мир творчества и цифровой обработки изображений. В течение этого курса дети будут вводиться в основы создания и редактирования видео. Они узнают, как собирать кадры в последовательность, добавлять переходы между ними и даже внедрять небольшие эффекты. <br>Курс структурирован таким образом, чтобы быть понятным и увлекательным для детей в возрасте от 8 лет. Он включает в себя: <br>Основные понятия видеомонтажа: дети узнают, что такое кадр, сцена, переходы, наложение звука и многое другое. <br>Инструменты и программы: дети ознакомятся с программами для видеомонтажа, предназначенными для начинающих, и узнают, как пользоваться базовыми инструментами. <br>Создание собственных проектов: дети будут создавать небольшие видеоролики, комбинируя видео и звуковые эффекты, чтобы рассказать свои истории. <br>Креативность и эксперименты: детям будет предоставлена свобода экспериментировать с различными эффектами, цветами и стилями, чтобы выразить свою индивидуальность. <br>Курс будет структурирован с учетом возрастных особенностей детей, с акцентом на визуальное обучение, понятные примеры и интерактивные задания. В результате дети получат основные навыки видеомонтажа, которые могут послужить им в качестве стартовой точки для развития творческих навыков и интереса к медийной сфере.",
    img: (await import("@/assets/images/video.jpg")).default,
  },
  {
    title: "Прграммирование в Scratch",
    price: 400,
    type: "Очное обучение",
    description: "Занятия проводятся для детей от 6 лет<br>400р - 1 занятие (Разовое посещение занятия)<br>1400р - 4 занятия(абонемент на месяц)<br>Курс 'Программирование в Scratch' представляет собой захватывающее введение в мир программирования и творчества для самых маленьких. Данный курс разработан специально для детей в возрасте от 6 лет и старше, чтобы они могли начать погружение в основы программирования через визуальный и интуитивно понятный интерфейс.<br>В течение курса дети узнают о базовых понятиях программирования, таких как команды, последовательности, циклы и условия, через создание интересных проектов и анимаций. Основой курса является платформа Scratch, которая позволяет детям создавать свои собственные интерактивные истории, игры и анимации, перетаскивая и соединяя графические блоки.<br>Курс ставит перед детьми задачу не только научить их создавать простые программы, но и стимулировать их творческие способности и логическое мышление. В ходе занятий дети будут экспериментировать, делать свои первые шаги в решении задач и развивать навыки рационального и абстрактного мышления.    <br>В конечном итоге, курс 'Scratch для детей от 6 лет' не только предоставляет детям возможность научиться программированию, но и помогает им развивать ключевые навыки, которые пригодятся в будущем, вне зависимости от выбранной ими области деятельности.",
    img: (await import("@/assets/images/scratch.jpg")).default,
  },
  {
    title: "Программирование на Python",
    price: 500,
    type: "Очное обучение",
    description: "Занятия проводятся для детей от 8 до 15 лет<br>500р - 1 занятие (Разовое посещение занятия)<br>1600р - 4 занятия(абонемент на месяц)<br>Курс программирования Python с нуля для детей - это увлекательное и интерактивное введение в мир программирования, специально разработанное для детей, которые только начинают свой путь в этой области. Курс призван сделать обучение Python интересным, понятным и доступным для детей возрастом от 8 лет и старше.<br>Этот курс - волшебное приглашение в мир программирования для маленьких исследователей и будущих гениев. Если ваш ребенок увлечен компьютерами, технологиями и хочет научиться создавать свои собственные игры, приложения и веб-сайты, то это именно тот курс, который ему нужен.<br>Что ваш ребенок изучит:<br>Основы Python: переменные, операторы, условия и циклы.<br>Создание своих первых программ и игр.<br>Введение в алгоритмы и логику программирования.",
    img: (await import("@/assets/images/python.png")).default,
  },
  {
    title: "Программирование на Python в Minecraft",
    price: 500,
    type: "Очное обучение",
    description: "Занятия проводятся для детей от 8 до 15 лет <br>500р - 1 занятие (Разовое посещение занятия) <br>1600р - 4 занятия(абонемент на месяц) <br>Курс 'Программирование в Minecraft на Python' представляет увлекательное и образовательное путешествие для детей в возрасте от 8 лет в мир программирования и творчества. В рамках этого курса дети учатся создавать и управлять виртуальным миром Minecraft с помощью языка программирования Python. <br>Дети будут изучать основы Python, начиная с простых команд и постепенно переходя к более сложным концепциям. С помощью Python они будут взаимодействовать с Minecraft-миром, создавая свои уникальные модификации, добавляя новые блоки, предметы и функциональность. Курс способствует развитию логического мышления, алгоритмического мышления и творческого подхода к решению задач. <br>Дети будут: <br>Изучать основы программирования на Python. <br>Осваивать базовые понятия Minecraft и взаимодействовать с игровым миром. <br>Создавать и управлять структурами в Minecraft с помощью программирования. <br>Разрабатывать собственные моды и плагины для Minecraft. <br>Решать интересные задачи и головоломки, интегрированные в игровую среду. <br>Курс направлен на то, чтобы показать детям, что программирование может быть не только полезным навыком, но и увлекательной игрой, которая открывает возможности для реализации их собственных идей в мире Minecraft. Этот курс стимулирует детскую фантазию, развивает навыки решения проблем и предоставляет платформу для самовыражения через создание виртуальных миров.",
    img: (await import("@/assets/images/minecraft_python.png")).default,
  },
  {
    title: "3D моделирование в Blender",
    price: 600,
    type: "Очное обучение",
    description: "Занятия проводятся для детей от 8 до 15 лет<br>600р - 1 занятие (Разовое посещение занятия)<br>2000р - 4 занятия(абонемент на месяц)<br>Курс 'Blender 3D моделирование' - это захватывающее путешествие в мир трехмерного моделирования и анимации специально разработанное для детей от 8 лет и старше. В течение курса дети будут изучать основы работы с программой Blender, которая является мощным инструментом для создания 3D графики.<br>С помощью интерактивных уроков и понятных объяснений дети научатся:<br>Основам интерфейса: Познакомятся с основными элементами программы, такими как панели инструментов, окна просмотра и таймлайн.<br>Моделированию: Узнают, как создавать простые 3D объекты, изменять их форму и размер, а также соединять их в более сложные композиции.<br>Текстурированию: Изучат, как добавлять цвета, текстуры и изображения на поверхности 3D объектов, делая их более реалистичными.<br>Анимации: Освоят основы создания движения в 3D пространстве, анимирования объектов и создания простых сцен.<br>Освещению и камерам: Узнают, как добавлять освещение в сцену и управлять камерами для создания динамичных ракурсов.<br>Рендерингу: Познакомятся с процессом создания окончательных изображений или анимаций из созданных 3D сцен.<br>Курс ориентирован на максимально интересное и понятное детям обучение, используя игровые элементы и практические задания для закрепления знаний. В конце курса дети будут гордиться своими собственными 3D проектами, которые они создадут с нуля. Курс 'Введение в Blender для детей (8+)' станет отличным стартовым шагом для будущих творцов в мире трехмерной графики.",
    img: (await import("@/assets/images/blender.jpg")).default,
  },
  {
    title: "Создание сайтов на Tilda",
    price: 400,
    type: "Онлайн-курс",
    description: "400р - 1 занятие (Разовое посещение занятия)<br>1400р - 4 занятия(абонемент на месяц)<br>Курс 'Создание сайта на Tilda' представляет собой захватывающее приключение в мире веб-дизайна и творчества, специально разработанное для детей в возрасте от 8 до 15 лет. В рамках этого курса дети учатся создавать свои собственные уникальные веб-страницы с использованием популярной платформы Tilda.<br>По завершении курса, дети будут способны самостоятельно создавать креативные и интерактивные веб-страницы, которыми могут гордиться. Они приобретут ценные навыки в области веб-дизайна, а также улучшат свою способность креативного мышления и самовыражения. Кроме того, они будут готовы к более сложным проектам в будущем и могут использовать полученные навыки как хобби или даже как начальный шаг к будущей карьере в сфере веб-разработки.",
    img: (await import("@/assets/images/tilda.jpg")).default,
  },
  {
    title: "Продвинутый видеомонтаж",
    price: 550,
    type: "Онлайн-курс",
    description: "Занятия проводятся для детей от 8 до 15 лет<br>550р - 1 занятие (Разовое посещение занятия)<br>2000р - 4 занятия(абонемент на месяц)<br>Курс 'Видеомонтаж продвинутый' представляет собой захватывающее путешествие в мир творчества и цифровой обработки видео. Данный курс предназначен для детей возрастом от 8 лет и старше, которые уже обладают базовыми знаниями видеомонтажа. В ходе обучения дети погрузятся в более глубокие аспекты редактирования видеоматериалов, научатся создавать захватывающие и креативные проекты.<br>Основные темы курса включают в себя:<br>Расширенные инструменты редактирования: Дети изучат продвинутые функции программы монтажа, такие как работа с ключевыми кадрами, анимацией, эффектами переходов и временной шкалой.<br>Цветокоррекция и цветовая градация: Ученики научатся изменять цветовую палитру видео для создания различных настроений и эффектов.<br>Звуковой дизайн: Дети освоят навыки работы с аудио эффектами, наложением звуковых дорожек и синхронизацией звука с видео.<br>Сложные монтажные приемы: Курс позволит детям изучить сложные техники монтажа, такие как наложение спецэффектов, трекинг движущихся объектов и многое другое.<br>Создание истории: Учащиеся научатся структурировать видеоматериалы в креативные и логически связанные истории.<br>Работа с графикой и текстом: Дети овладеют навыками добавления графических элементов, аннотаций и текстовых вставок в видео.<br>Экспорт и публикация: Ученики научатся сохранять и экспортировать свои проекты в различных форматах и подготавливать их для публикации в социальных сетях или на платформах видеохостинга.<br>Курс 'Видеомонтаж продвинутый' спроектирован так, чтобы вдохновить юных творцов на более творческое и профессиональное использование видеоредакторов. Ученики будут стимулированы к развитию своих навыков и созданию уникальных видеопроектов с помощью интересных и практических уроков.",
    img: (await import("@/assets/images/video2.jpg")).default,
  },
  {
    title: "Программирование в Kodu Gamelab",
    price: 500,
    type: "Очное обучение",
    description: "Занятия проводятся для детей от 6 лет<br>500р - 1 занятие (Разовое посещение занятия)<br>1500р - 4 занятия(абонемент на месяц)<br>Kodu Game Lab - это интерактивное средство обучения, разработанное для детей, чтобы они могли создавать собственные видеоигры и изучать основы программирования и гейм дизайна. В ходе курса Kodu Game Lab дети смогут освоить следующие навыки и концепции:<br>Основы программирования: Дети узнают основы алгоритмов и программирования, используя визуальный интерфейс, который позволяет им создавать код, перетаскивая и соединяя блоки.<br>Гейм дизайн: Ученики научатся создавать игровые миры, задавать правила игры, устанавливать цели и создавать интересные игровые сценарии.<br>Логика и решение задач: Курс позволяет развивать логическое мышление и способность решать задачи, так как создание игр требует детального планирования и размышления.<br>Креативность: Дети могут выразить свою креативность, создавая собственные персонажи, миры и истории в игре.<br>Компьютерная грамотность: Ученики овладеют навыками работы с компьютером, такими как управление файлами, сохранение проектов и взаимодействие с программным обеспечением для создания игр.<br>Разработка проектов: Дети учатся создавать целостные проекты, начиная с идеи и заканчивая готовой игрой, что способствует развитию навыков планирования и выполнения задач.<br>Коллаборация: В некоторых случаях дети могут работать в группах, учась сотрудничать и разрабатывать игры вместе с другими учениками.<br>Тестирование и обратная связь: Ученики узнают, как тестировать свои игры, выявлять ошибки и улучшать их на основе обратной связи.<br>Kodu Game Lab предоставляет отличную возможность детям начать свой путь в мире программирования и разработки видеоигр, при этом делая это доступным и увлекательным.",
    img: (await import("@/assets/images/kodu.png")).default,
  },
  {
    title: "Режиссер монтажа",
    price: 600,
    type: "Онлайн-курс",
    description: "Занятия проводятся для детей от 8 до 15 лет<br>600р - 1 занятие (Разовое посещение занятия)<br>2200р - 4 занятия(абонемент на месяц)<br>Курс 'Режиссер монтажа' – это захватывающее и интересное введение в мир кинематографического монтажа, специально разработанное для детей в возрасте от 8 лет. В течение курса дети будут учиться основам создания и редактирования видеоматериалов, играя и творчески экспериментируя с различными видами контента.<br>На курсе дети узнают:<br>Основы монтажа: Они овладеют базовыми понятиями монтажа, такими как кадр, план, монтажные переходы и их влияние на повествование.<br>Креативные техники: Дети изучат разнообразные креативные методы редактирования, такие как временные эффекты, визуальные эффекты и звуковой монтаж.<br>Создание истории: Они научатся собирать кадры в последовательность, чтобы рассказать интересную и понятную историю.<br>Работа с инструментами: Дети ознакомятся с базовыми инструментами редактирования видео, используемыми в популярных программных средах.<br>Эмоциональная экспрессия: Курс также поднимет важный аспект – как через монтаж можно передавать эмоции и настроение.<br>Сотрудничество и командная работа: Дети могут создавать видеопроекты в группах, что поможет им развить навыки сотрудничества и коммуникации.<br>Конечный продукт: В конце курса дети будут иметь возможность создать собственный короткий видеоролик, который объединит все их новые знания и навыки.<br>Этот курс способствует не только развитию творческого мышления, но и учит ценным навыкам обработки информации, ораторскому искусству и визуальной грамотности. Он предоставляет детям возможность ощутить себя мастерами своего собственного кинематографического мира, воплощая свои идеи и истории в увлекательных видеороликах.",
    img: (await import("@/assets/images/video2.jpg")).default,
  },
  {
    title: "Программирование в ScratchJr",
    price: 400,
    type: "Очное обучение",
    description: "Занятия проводятся для детей от 6 лет<br>400р - 1 занятие (Разовое посещение занятия)<br>1400р - 4 занятия(абонемент на месяц)<br>Курс ScratchJr - это захватывающий вводный курс программирования, специально разработанный для детей в возрасте от 6 лет. В рамках этого курса дети будут изучать основы программирования и компьютерной логики, используя интуитивный и визуальный подход, который основан на блок-схемах.<br>С помощью ScratchJr дети смогут создавать свои собственные интерактивные истории, анимации и игры. Они будут использовать блоки программного кода, которые можно перетаскивать и соединять, чтобы задавать поведение персонажей и объектов в их проектах. Курс поощряет творчество, логическое мышление и проблемное решение, а также помогает развивать навыки совместной работы и планирования.<br>Через создание своих собственных проектов дети будут учиться не только основам программирования, но и развивать воображение, выражать свои идеи и реализовывать их в интерактивной форме. ScratchJr делает процесс обучения доступным и увлекательным, помогая детям начать свой путь в мире технологий и компьютерного программирования с самого раннего возраста.",
    img: (await import("@/assets/images/scratchjr.png")).default,
  },
  {
    title: "Программирование в Roblox на Lua",
    price: 500,
    type: "Очное обучение",
    description: "Занятия проводятся для детей от 8 до 15 лет<br>500р - 1 занятие (Разовое посещение занятия)<br>1600р - 4 занятия(абонемент на месяц)<br>Курс 'Программирование в Roblox на Lua' — это захватывающее путешествие в мир создания собственных игр и виртуальных миров на платформе Roblox. В этом курсе дети познакомятся с основами программирования на языке Lua и научатся использовать Roblox Studio — мощный инструмент для разработки игр и контента.<br>С помощью интерактивных уроков и практических заданий дети научатся:<br>Основам Roblox Studio: Изучение интерфейса и основных инструментов для создания миров, объектов и персонажей.<br>Основам Lua: Введение в программирование на Lua, начиная с базовых концепций и синтаксиса.<br>Созданию персонажей: Дети научатся создавать своих персонажей, настраивать их анимации, движения и интерактивность.<br>Созданию объектов и среды: Разработка разнообразных объектов, декораций и среды для игры, включая их взаимодействие и поведение.<br>Сценариям и игровой логике: Понимание создания сценариев, реализации игровой логики, задания целей и условий для прохождения.<br>Тестированию и оптимизации: Освоение методов тестирования игры, выявления и устранения ошибок, а также оптимизации производительности.<br>Совместной разработке: Введение в коллаборативную работу над проектами с другими участниками.<br>Курс ставит целью не только научить детей программированию и созданию игр, но и развить их творческие и аналитические способности, а также способность работать в команде. В конце курса дети будут гордиться своими собственными проектами и иметь навыки, которые могут применить в будущем как в мире программирования, так и в других областях.",
    img: (await import("@/assets/images/roblox.png")).default,
  },
  {
    title: "Робототехника WeDo 2.0",
    price: 500,
    type: "Очное обучение",
    description: "Занятия проводятся для детей от 5 до 15 лет<br>500р - 1 занятие (Разовое посещение занятия)<br>1600р - 4 занятия(абонемент на месяц)<br>Курс Робототехника WeDo 2.0 - это захватывающий образовательный опыт, специально разработанный для детей в возрасте от 6 лет. Этот курс объединяет игру и обучение, позволяя маленьким ученикам погрузиться в мир робототехники через интерактивное создание и программирование простых роботов.<br>С помощью конструктора LEGO Education WeDo 2.0 и специального программного обеспечения, дети имеют возможность:<br>Создавать разнообразных роботов: Дети могут собирать различные модели роботов, используя наборы LEGO деталей. Каждая модель представляет собой увлекательное задание с конкретной целью.<br>Программировать роботов: Специальное программное обеспечение позволяет детям научить своих роботов выполнять разнообразные действия, используя блоки программирования в интерфейсе 'перетащи и отпусти'. Это позволяет детям познакомиться с основами логики и алгоритмов.<br>Решать задачи и головоломки: Курс включает в себя серию увлекательных задач и головоломок, которые дети должны решать с помощью своих роботов. Это способствует развитию креативного и критического мышления.<br>Развивать научный подход: Дети изучают базовые принципы науки и инженерии, проводя эксперименты с различными конструкциями и программами.<br>Сотрудничать и коммуницировать: В ходе курса дети могут работать в парах или небольших группах, что помогает развивать навыки коммуникации, сотрудничества и разделения задач.<br>Стимулировать творчество: Курс поощряет детей использовать свою фантазию при создании и улучшении роботов, что способствует развитию творческого мышления.<br>Курс Робототехника WeDo 2.0 позволяет детям весело и интересно изучать фундаментальные концепции робототехники и программирования, создавая прочную основу для их будущего образования в этой области.",
    img: (await import("@/assets/images/robot.jpg")).default,
  }
]
</script>

<style>
.card:hover {
  z-index: 1;
}
</style>