export default [
  {
    title: 'Вёрстка сайтов (HTML и CSS)',
    text: `Курс "Верстка сайта (HTML и CSS)" - это путешествие для детей от 10 до 16 лет в мир веб-разработки через изучение основ создания сайтов с использованием HTML и CSS.`,
    price: 450,
    type: 'Очное обучение',
    desctiption: `450р - 1 занятие (Разовое посещение занятия)<br>1500р - 4 занятия(абонемент на месяц)<br>Курс "Верстка сайта (HTML и CSS) для детей" предназначен для детей, возрастом от 10 до 16 лет, которые интересуются созданием собственных веб-сайтов. Этот курс нацелен на то, чтобы дети могли освоить основы веб-разработки, используя HTML и CSS - два фундаментальных языка для создания веб-страниц.<br>Цели и задачи курса:<br>Основы HTML: Дети изучат структуру HTML-документа, узнают о тегах, элементах, заголовках, параграфах, списках и ссылках.<br>Оформление с помощью CSS: Учащиеся научатся создавать стили для своих веб-страниц с помощью CSS, включая цвета, шрифты, размеры и фоновые изображения.<br>Макет и расположение элементов: Дети изучат основы макета веб-страницы, включая блочную модель, позиционирование элементов и создание простых макетов.<br>Работа с мультимедиа: Ученики научатся вставлять изображения и видео на свои страницы и настраивать их отображение.<br>Работа с формами: Дети узнают, как создавать формы для сбора информации от посетителей сайта, такие как контактные данные или отзывы.<br>Основы адаптивного дизайна: Курс может также включать в себя введение в адаптивный дизайн, чтобы дети могли делать свои сайты удобными для просмотра на разных устройствах.<br>Проектная работа: Курс может завершаться проектной работой, где ученики будут создавать свой собственный небольшой веб-сайт, применяя знания, полученные на занятиях.<br>Сотрудничество и коммуникация: Поддержка коммуникации и сотрудничества между учениками может стимулировать обмен знаний и идей.<br>Методы обучения:<br>Практические упражнения: Ученики будут активно создавать веб-страницы на практике, что поможет им лучше усвоить материал.<br>Интерактивные задания: Задания, требующие решения различных задач, помогут развивать аналитические навыки.<br>Проектная работа: Создание собственного сайта будет стимулировать творческое мышление и самостоятельность.<br>Обратная связь: Регулярная обратная связь и обсуждение результатов помогут ученикам развивать навыки и исправлять ошибки.<br>Преимущества курса:<br>Практическая польза: Ученики смогут создавать свои собственные веб-сайты, что может быть полезно для их будущей карьеры в IT или даже для создания личных проектов.<br>Развитие навыков: Курс способствует развитию логического мышления, креативности и коммуникационных навыков.<br>Доступность: HTML и CSS - это открытые и бесплатные технологии, и дети могут использовать их на любом компьютере с доступом в Интернет.<br>Поддержка учителя: Наличие опытного преподавателя, специализирующегося на обучении детей, поможет обеспечить эффективное обучение.`
  },
  {
    title: 'Программирование на Python в Minecraft',
    text: `Курс "Программирование в Minecraft на Python" - это увлекательное путешествие для детей в мир программирования и творчества через создание и управление виртуальным миром Minecraft с помощью языка Python.`,
    price: 500,
    type: 'Очное обучение',
    desctiption: `Занятия проводятся для детей от 8 до 15 лет <br>500р - 1 занятие (Разовое посещение занятия) <br>1600р - 4 занятия(абонемент на месяц) <br>Курс 'Программирование в Minecraft на Python' представляет увлекательное и образовательное путешествие для детей в возрасте от 8 лет в мир программирования и творчества. В рамках этого курса дети учатся создавать и управлять виртуальным миром Minecraft с помощью языка программирования Python. <br>Дети будут изучать основы Python, начиная с простых команд и постепенно переходя к более сложным концепциям. С помощью Python они будут взаимодействовать с Minecraft-миром, создавая свои уникальные модификации, добавляя новые блоки, предметы и функциональность. Курс способствует развитию логического мышления, алгоритмического мышления и творческого подхода к решению задач. <br>Дети будут: <br>Изучать основы программирования на Python. <br>Осваивать базовые понятия Minecraft и взаимодействовать с игровым миром. <br>Создавать и управлять структурами в Minecraft с помощью программирования. <br>Разрабатывать собственные моды и плагины для Minecraft. <br>Решать интересные задачи и головоломки, интегрированные в игровую среду. <br>Курс направлен на то, чтобы показать детям, что программирование может быть не только полезным навыком, но и увлекательной игрой, которая открывает возможности для реализации их собственных идей в мире Minecraft. Этот курс стимулирует детскую фантазию, развивает навыки решения проблем и предоставляет платформу для самовыражения через создание виртуальных миров.`,
  },
  {
    title: 'Основы видеомонтажа',
    text: `Курс "Основы видеомонтажа для детей от 8 лет" приглашает детей в захватывающее путешествие в мир цифровой обработки видео и развития творческих способностей. На протяжении курса юные монтажёры познакомятся с базовыми понятиями монтажа, освоят инструменты видеоредакторов и создадут собственные небольшие фильмы, экспериментируя с эффектами и стилями. Обучение построено с учётом возрастных особенностей детей и включает в себя визуальные, понятные материалы, а также интерактивные творческие задания.`,
    price: 500,
    type: 'Онлайн-курс',
    desctiption: `
      Занятия проводятся для детей от 8 до 15 лет
      <br>500р - 1 занятие (Разовое посещение занятия)
      <br>1600р - 4 занятия(абонемент на месяц)
      <br>Курс "Основы видеомонтажа для детей от 8 лет" представляет собой захватывающее путешествие в мир творчества и цифровой обработки изображений. В течение этого курса дети будут вводиться в основы создания и редактирования видео. Они узнают, как собирать кадры в последовательность, добавлять переходы между ними и даже внедрять небольшие эффекты.
      <br>Курс структурирован таким образом, чтобы быть понятным и увлекательным для детей в возрасте от 8 лет. Он включает в себя:
      <br>Основные понятия видеомонтажа: дети узнают, что такое кадр, сцена, переходы, наложение звука и многое другое.
      <br>Инструменты и программы: дети ознакомятся с программами для видеомонтажа, предназначенными для начинающих, и узнают, как пользоваться базовыми инструментами.
      <br>Создание собственных проектов: дети будут создавать небольшие видеоролики, комбинируя видео и звуковые эффекты, чтобы рассказать свои истории.
      <br>Креативность и эксперименты: детям будет предоставлена свобода экспериментировать с различными эффектами, цветами и стилями, чтобы выразить свою индивидуальность.
      <br>Курс будет структурирован с учетом возрастных особенностей детей, с акцентом на визуальное обучение, понятные примеры и интерактивные задания. В результате дети получат основные навыки видеомонтажа, которые могут послужить им в качестве стартовой точки для развития творческих навыков и интереса к медийной сфере.
    `,
  },
  {
    title: '',
    text: ``,
    price: '',
    type: '',
    desctiption: ``,
  },
  {
    title: '',
    text: ``,
    price: '',
    type: '',
    desctiption: ``,
  },
  {
    title: '',
    text: '',
    price: '',
    type: '',
    desctiption: '',
  }
]

