export default [
  {
    title: 'Вёрстка сайтов (HTML и CSS)',
    text: 'Курс "Верстка сайта (HTML и CSS) для детей" предназначен для детей от 10 до 16 лет, интересующихся созданием веб-сайтов. Он поможет им освоить основы HTML и CSS - основных языков для создания веб-страниц. Курс включает изучение структуры HTML-документа, оформления с помощью CSS, макета и расположения элементов, работы с мультимедиа и формами, адаптивного дизайна. Ученики также будут создавать свой собственный проектный сайт. Курс предлагает практические упражнения, интерактивные задания, проектную работу и обратную связь. Он способствует развитию логического мышления, креативности и коммуникационных навыков, и доступен на любом компьютере с доступом в Интернет.',
    prive: 450,
    type: 'Очное обучение',
  },
  {
    title: 'Курс 2',
    text: 'ФЫВФЫЫФРЩОРИАЩОШ',
    type: 'Заочное обучение',
  }
]